{"config": [{"config": {"dim_ordering": "tf", "nb_row": 5, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_1", "b_regularizer": null, "nb_filter": 24, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "input_dtype": "float32", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_2", "nb_filter": 36, "b_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_3", "nb_filter": 48, "b_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "name": "maxpooling2d_3", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_4", "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "name": "maxpooling2d_4", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_5", "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "name": "maxpooling2d_5", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "name": "dense_1", "output_dim": 100, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "dense_2", "output_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "dense_3", "output_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "dense_4", "output_dim": 1, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}